/* ================================
  ■■■ 자바 기본 프로그래밍 ■■■
  ================================= */

// 퀴즈
// 직사각형의 넓이와 둘레를 구하는 프로그램을 작성한다
// → 가로 : 10, 세로 : 20

// 실행 예)
// 넓이 : xxxxxx
// 둘레 : xxxxxx
// 계속하려면 아무 키나 누르세요...

public class Test013
{
	public static void main(String[] args)
	{
		/* 내가 풀이한 내용 ----------------------------------
		int a = 10;
		int b = 20;

		int area, length;

		area = a * b;
		length = (a+b)*2;

		System.out.println("넓이 : " + area);
		System.out.println("둘레 : " + length);
		
		// 출력 결과
		/*
		넓이 : 200
		둘레 : 60
		계속하려면 아무 키나 누르십시오 . . .  
		
	    내가 풀이한 내용 ---------------------------------- */



	}
}