/*============================================
  ■■■ 실행 흐름의 컨트롤(제어문) ■■■
============================================*/

// 반복문(for문) 실습
// 다중 for문(반복문의 중첩)을 활용한 구구단 출력 실습

/*
// 웅 ~ 웅~
for (; ; )
{
	// 쑝쑝쑝~
	for (; ; )
	{
	}

}
*/

// 실행 예)
/*
[2단]
2 * 1 = 2
  :
2 * 9 = 18

[3단]
3 * 1 = 3
  :
3 * 9 = 81
계속하려면 아무 키나 누르세요
*/

public class Test061
{
	public static void main(String[]args)
	{
		int a,b;		// 루프변수
		
		// 웅 ~ 웅 ~
		for (a=2;a<=9 ; a++)			// 단 처리
		{
			//System.out.println(" [ " + a +"단 ]");
			System.out.printf("\n====[%d단]====\n",a);
			
			//쑝쑝쑝
			for (b=1;b<=9 ;b++ )		// 곱해지는 수 처리
			{
				//System.out.println(a+" * "+b+" = "+ a*b);
				System.out.printf("%3d * %d = %2d\n",a,b,(a*b));
			}
		}
	}
}